<template>
    <v-container fluid class="ma-0 fill-height bg-grey-lighten-3">
        <v-col class="d-flex fill-height flex-column">
            <v-row class="flex-shrink-1 flex-grow-0">
                <v-col>
                    <SubpageTitle text="消息通知" icon="mdi-message-bookmark-outline" @drawerToggle="$emit('drawerToggle')">
                    </SubpageTitle>
                </v-col>
            </v-row>

            <v-row style="flex-basis: 0; overflow: hidden;">
                <v-col class="fill-height d-flex">
                    <v-sheet rounded="lg" class="d-flex flex-column" style="overflow: auto;">
                        <v-list lines="two">
                            <v-list-item value="1" title="第二十三届研究生体育文化节之软件学院 “Coder Run杯”小组赛成功举办"
                                subtitle="为营造良好的新生校园氛围，增进同学交流，倡导素质、体质教育，唤醒同学们的运动热情，感受在篮球场奔跑、挥洒汗水的乐趣。在浙江大学第二十三届研究生体育文化节之际，学院筹备举办了“Coder Run杯”篮球主题系列赛。

                                                        我院为丰富在甬研究生文化体育生活，展现新时代我院研究生蓬勃朝气的精神风貌和竞技热情。系列赛秉承“友谊第一，比赛第二，以球会友，强身健体，促进交流”的宗旨，旨在提高同学们体育锻炼的积极性，活跃校园体育文化氛围。我院研究生组成的八只篮球队分为AB两个小组，在11月到12月期间于宁波市浙江大学软件学院篮球场，陆续开展了十二场小组循环赛。

                                                        此次比赛本着“友谊第一，比赛第二”的原则，不仅仅丰富了学校生活，提高了学生们进行体育活动的热情和参加体育锻炼的进取性。并且在比赛中增进了友谊，培养了团结写作的精神，到达了预期效果，同时凭借篮球的独特魅力也向我们展示了当代大学生的蓬勃朝气和青春的气息。

                                                           在比赛现场，无论是参赛队员还是替补队员都严阵以待，伴随着哨声的响起，现场的氛围极具攀升，高高抛起的篮球点燃了本次篮球赛的活力，双方队员迅速进入状态，全力以赴。赛场上，各个参赛队员积极配合，卡位、补防，转换快攻一气呵成；中场休息时，同学们之间积极讨论，商量战术，研究对策。比赛过程中，裁判员秉公执法，严肃认真，尽自我最大的努力判决好每一个球，保障了比赛的公正性和观赏性。为我们献出了一场又一场精彩的比赛。

                                                          “比赛过程中，不仅涌现出了许多软院的篮球高手，看到了大家在赛场上积极拼抢以及精彩的配合也是颠覆了程序员的传统形象；同时，也看到了大家在赛场上愈发娴熟的不只有球技，更有比赛过程中不断磨合，产生的友情。”裁判员张典典在参与了多场比赛后如是说到。">
                                <template v-slot:append>
                                    <v-label class="ml-5" text="学院党委"></v-label>

                                    <v-label class="ml-5" text="2022-12-21"></v-label>
                                </template>
                            </v-list-item>
                            <v-list-item value="2" title="第二十三届研究生体育文化节之软件学院 “Coder Run杯”小组赛成功举办"
                                subtitle="为营造良好的新生校园氛围，增进同学交流，倡导素质、体质教育，唤醒同学们的运动热情，感受在篮球场奔跑、挥洒汗水的乐趣。在浙江大学第二十三届研究生体育文化节之际，学院筹备举办了“Coder Run杯”篮球主题系列赛。

                                                        我院为丰富在甬研究生文化体育生活，展现新时代我院研究生蓬勃朝气的精神风貌和竞技热情。系列赛秉承“友谊第一，比赛第二，以球会友，强身健体，促进交流”的宗旨，旨在提高同学们体育锻炼的积极性，活跃校园体育文化氛围。我院研究生组成的八只篮球队分为AB两个小组，在11月到12月期间于宁波市浙江大学软件学院篮球场，陆续开展了十二场小组循环赛。

                                                        此次比赛本着“友谊第一，比赛第二”的原则，不仅仅丰富了学校生活，提高了学生们进行体育活动的热情和参加体育锻炼的进取性。并且在比赛中增进了友谊，培养了团结写作的精神，到达了预期效果，同时凭借篮球的独特魅力也向我们展示了当代大学生的蓬勃朝气和青春的气息。

                                                           在比赛现场，无论是参赛队员还是替补队员都严阵以待，伴随着哨声的响起，现场的氛围极具攀升，高高抛起的篮球点燃了本次篮球赛的活力，双方队员迅速进入状态，全力以赴。赛场上，各个参赛队员积极配合，卡位、补防，转换快攻一气呵成；中场休息时，同学们之间积极讨论，商量战术，研究对策。比赛过程中，裁判员秉公执法，严肃认真，尽自我最大的努力判决好每一个球，保障了比赛的公正性和观赏性。为我们献出了一场又一场精彩的比赛。

                                                          “比赛过程中，不仅涌现出了许多软院的篮球高手，看到了大家在赛场上积极拼抢以及精彩的配合也是颠覆了程序员的传统形象；同时，也看到了大家在赛场上愈发娴熟的不只有球技，更有比赛过程中不断磨合，产生的友情。”裁判员张典典在参与了多场比赛后如是说到。">
                                <template v-slot:append>
                                    <v-label class="ml-5" text="学院党委"></v-label>

                                    <v-label class="ml-5" text="2022-12-21"></v-label>
                                </template>
                            </v-list-item>
                        </v-list>
                    </v-sheet>
                </v-col>
            </v-row>
        </v-col>
    </v-container>
</template>

<script setup>

import SubpageTitle from '@/components/SubpageTitle.vue';

defineEmits(['drawerToggle']);

</script>